---
kind: method
id: M:Autodesk.Revit.DB.Analysis.AnalysisDisplayLegendSettings.IsEqual(Autodesk.Revit.DB.Analysis.AnalysisDisplayLegendSettings)
source: html/364eea7f-c62f-f2d7-b52d-0f2379a18f8b.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayLegendSettings.IsEqual Method

Compares two legend settings objects.

## Syntax (C#)
```csharp
public bool IsEqual(
	AnalysisDisplayLegendSettings other
)
```

## Parameters
- **other** (`Autodesk.Revit.DB.Analysis.AnalysisDisplayLegendSettings`) - Legend settings object to compare to.

## Returns
True if objects are equal, false otherwise.